---
order: 0.2
title: Задача 1. Линейный поиск в одномерном массиве
---

**Задание:** Заполните массив из 15 целых чисел случайными значениями в заданном вами диапазоне. Напишите программу, которая использует алгоритм **линейного поиска** для решения задачи вашего варианта.

**Обязательные требования:**

1. Реализовать функцию `LinearSearch`, которая возвращает индекс найденного элемента и количество выполненных итераций

2. Использовать `Stopwatch` для измерения времени выполнения поиска

3. Вывести: результат поиска, количество итераций, время выполнения

4. **Теоретический вопрос:** Объяснить, почему полученное количество итераций соответствует временной сложности O(n). Определить пространственную сложность алгоритма (сложность алгоритма по памяти).

   ***Пространственная сложность алгоритма** -- это мера объёма памяти, необходимого для выполнения алгоритма в зависимости от размера входных данных. Измеряется количеством ячеек памяти, которые алгоритм использует для хранения данных во время выполнения.*

   **Шаблон решения**

   ```
   using System;
   using System.Diagnostics;
   
   class Program
   {
       // Метод линейного поиска первого чётного элемента
       static (int index, int iterations) LinearSearch(int[] array)
       {
           int iterations = 0;
           
           for (int i = 0; i < array.Length; i++)
           {
               iterations++;
               if (array[i] % 2 == 0)  // Условие для чётного числа
               {
                   return (i, iterations);
               }
           }
           
           return (-1, iterations);
       }
   
       static void Main()
       {
           // Создание и заполнение массива случайными числами
           Random random = new Random();
           int[] array = new int[15];
           
           Console.WriteLine("Сгенерированный массив:");
           for (int i = 0; i < array.Length; i++)
           {
               array[i] = random.Next(1, 100);  // числа от 1 до 99
               Console.Write(array[i] + " ");
           }
           Console.WriteLine();
           
           // Измерение времени выполнения поиска
           var stopwatch = Stopwatch.StartNew();
           var (index, iterations) = LinearSearch(array);
           stopwatch.Stop();
           
           // Вывод результатов
           if (index != -1)
           {
               Console.WriteLine($"Первый чётный элемент: {array[index]}");
               Console.WriteLine($"Индекс найденного элемента: {index}");
           }
           else
           {
               Console.WriteLine("Чётные элементы не найдены");
           }
           
           Console.WriteLine($"Количество итераций: {iterations}");
           Console.WriteLine($"Время выполнения: {stopwatch.ElapsedTicks} тиков");
           //Console.WriteLine($"Время: {stopwatch.Elapsed.TotalSeconds} секунд");
           Console.WriteLine($"Время выполнения: {stopwatch.ElapsedMilliseconds} мс");
           
           // Анализ сложности
           Console.WriteLine("\nАнализ сложности алгоритма:");
           Console.WriteLine("Временная сложность: O(n) - линейная, что подтверждается...");
           Console.WriteLine("Пространственная сложность: O() -");
           Console.WriteLine("Объяснение: ...");
       }
   }
   ```

| **Вариант** | **Условие для поиска**                                                                                           |
|-------------|------------------------------------------------------------------------------------------------------------------|
| 1           | Найти последний чётный элемент в массиве.                                                                        |
| 2           | Найти первый элемент, который делится на 5 и на 3 одновременно.                                                  |
| 3           | Найти первый отрицательный элемент.                                                                              |
| 4           | Найти элемент, значение которого больше 20 и меньше 50.                                                          |
| 5           | Найти последний элемент, оканчивающийся на 4.                                                                    |
| 6           | Найти первый элемент, который является точным квадратом любого числа.                                            |
| 7           | Найти элемент, который находится в середине диапазона от -10 до 10.                                              |
| 8           | Найти последний элемент, сумма цифр которого равна 8.                                                            |
| 9           | Найти первый элемент, который больше суммы своих соседей (для крайних элементов проверять только одного соседа). |
| 10          | Найти последний элемент, значение которого равно его индексу.                                                    |
| 11          | Найти первый элемент, который является палиндромом (например, 121, 1331).                                        |
| 12          | Найти последний элемент, модуль которого меньше 0.5 (для массива дробных чисел).                                 |