---
order: 0.3
title: Задача 2. Бинарный поиск в одномерном массиве
---

**Задание**: Создайте отсортированный по возрастанию массив из 20 строк (например, фамилий студентов или названий городов). Напишите программу, которая использует алгоритм бинарного поиска для определения позиции заданной строки.

Требование: Реализовать и использовать функцию BinarySearch, которая возвращает индекс найденной строки или -1, если строка не найдена. Учесть, что поиск должен быть регистронезависимым.

1. Использовать `Stopwatch` для измерения времени выполнения поиска

2. Вывести: результат поиска, количество итераций, время выполнения

3. **Теоретический вопрос:** Объяснить, почему полученное количество итераций соответствует временной сложности O(logN). Определить пространственную сложность алгоритма (сложность алгоритма по памяти).

   **Шаблон решения**

   ```
   static (int index, int iterations) BinarySearch(string[] array, string target) {
   
   //инициализация нужных переменных
   
   while(...) {
               // Простое сравнение строк
               int comparison = 0; 
               // 0 - равны, -1 - midValue < target, 1 - midValue > target
               
               // Сравниваем строки посимвольно
               for (int i = 0; i < Math.Min(midValue.Length, target.Length); i++)
               {
                   if (midValue[i] < target[i])
                   {
                       comparison = -1;
                       break;
                   }
                   else if (midValue[i] > target[i])
                   {
                       comparison = 1;
                       break;
                   }
               }
               
               // Если все символы совпали, но строки разной длины
               if (comparison == 0 && midValue.Length != target.Length)
               {
                   comparison = midValue.Length < target.Length ? -1 : 1;
               }
               
               if (comparison == 0)
               {
                   return (mid, iterations); // Нашли
               }
               else if (comparison < 0)
               {
                   left = mid + 1; // Искомый элемент справа
               }
               else
               {
                   right = mid - 1; // Искомый элемент слева
               }
           }
   }
   static void Main()
       {
          
           string[] names = {
              
           };
           
           Array.Sort(names); // Убедимся, что массив отсортирован
           
           Console.WriteLine("Отсортированный массив имен:");
           for (int i = 0; i < names.Length; i++)
           {
               Console.WriteLine($"{i}: {names[i]}");
           }
           Console.WriteLine();
           
           // Поиск
           string target = "Михаил";
           Console.WriteLine($"Поиск имени: {target}");
           
           var stopwatch = Stopwatch.StartNew();
           var (index, iterations) = BinarySearchSimple(names, target);
           stopwatch.Stop();
           
           // Результаты
           if (index != -1)
           {
               Console.WriteLine($"Найдено: {names[index]} (индекс {index})");
           }
           else
           {
               Console.WriteLine("Не найдено");
           }
           
           Console.WriteLine($"Итераций: {iterations}");
           Console.WriteLine($"Время: {stopwatch.ElapsedTicks} тиков");
           //Console.WriteLine($"Время: {stopwatch.Elapsed.TotalSeconds} секунд");
           
           // Анализ
           Console.WriteLine($"\nРазмер массива: {names.Length}");
           Console.WriteLine("Сложность: O(log n),что подтверждается...");
           Console.WriteLine("Пространственная сложность: O() -");
           Console.WriteLine("Объяснение: ...");
       }
   }
   ```

| **Вариант** | **Исходный отсортированный массив строк (для примера)**              |
|-------------|----------------------------------------------------------------------|
| 1           | Фамилии: Иванов, Смирнов, Кузнецов, Попов, Васильев...               |
| 2           | Названия городов: Казань, Москва, Новосибирск, Сочи, Екатеринбург... |
| 3           | Названия стран: Бразилия, Германия, Канада, Россия, Япония...        |
| 4           | Имена: Александр, Алексей, Дмитрий, Михаил, Сергей...                |
| 5           | Названия цветов: Аквилегия, Георгин, Ирис, Лилия, Пион...            |
| 6           | Названия фруктов: Абрикос, Апельсин, Банан, Груша, Яблоко...         |
| 7           | Марки автомобилей: BMW, Lada, Mercedes, Toyota, Volkswagen...        |
| 8           | Профессии: Врач, Инженер, Программист, Учитель, Юрист...             |
| 9           | Названия рек: Волга, Дон, Енисей, Обь, Лена...                       |
| 10          | Животные: Волк, Заяц, Лиса, Медведь, Тигр...                         |
| 11          | Планеты: Венера, Земля, Марс, Меркурий, Юпитер...                    |
| 12          | Языки программирования: C#, C++, Java, JavaScript, Python...         |